fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите месяц (период)!", "Объект.Период");
		Возврат;
	КонецЕсли;
	
	Элементы.Сформировать.Доступность = Ложь;
	
	ФоновоеЗаданиеПроцент  = 0;
	СтрокаСостояния         = "Подготовка...";
	ИдентификаторЗадания    = Неопределено;
	
	ДлительнаяОперация = ЗапуститьФормированиеНаСервере();
	
	Если ДлительнаяОперация = Неопределено Тогда
		Элементы.Сформировать.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания     = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал                 = 1;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияИндикатор", 1, Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияФормирования", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗавершенияФормирования(Результат, ДопПараметры) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
	
	Элементы.Сформировать.Доступность = Истина;
	
	Если Результат = Неопределено Тогда
		СтрокаСостояния = "Операция отменена";
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ФоновоеЗаданиеПроцент = 100;
		СтрокаСостояния = "Формирование завершено";
		Элементы.СтрокаСостояния.ЦветТекста = WebЦвета.ТемноЗеленый;
		
		ЗаполнитьРезультатНаФорме(АдресРезультата);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		СтрокаСостояния = "Ошибка: " + Результат.КраткоеПредставлениеОшибки;
		Элементы.СтрокаСостояния.ЦветТекста = WebЦвета.Красный;
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = Результат.ПодробноеПредставлениеОшибки;
		СообщениеПользователю.Сообщить();
	Иначе
		СтрокаСостояния = "Неизвестный статус: " + Результат.Статус;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработчикОжиданияИндикатор() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	Прогресс = ПрочитатьПрогрессНаСервере(ИдентификаторЗадания);
	
	Если Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Прогресс.Свойство("Процент") Тогда
		ФоновоеЗаданиеПроцент = Прогресс.Процент;
	КонецЕсли;
	
	Если Прогресс.Свойство("Текст") Тогда
		СтрокаСостояния = Прогресс.Текст;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ЗапуститьФормированиеНаСервере()
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", КонецДня(Объект.Период));
	ПараметрыПроцедуры.Вставить("АдресРезультата", АдресРезультата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Массовое создание актов реализации'");
	ПараметрыВыполнения.КлючФоновогоЗадания         = "ВКМ_МассовоеСозданиеАктов_" + Строка(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Обработки.ВКМ_МассовоеСозданиеАктов.СформироватьАкты",
		ПараметрыПроцедуры);
	
КонецФункции


&НаСервере
Функция ПрочитатьПрогрессНаСервере(ИдентификаторФоновогоЗадания)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	Если Задание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Возврат Новый Структура("Процент, Текст", 0, "Аварийное завершение");
	КонецЕсли;
	
	Прогресс = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторФоновогоЗадания);
	Если Прогресс = Неопределено Тогда
		Прогресс = Новый Структура;
	КонецЕсли;
	
	Прогресс.Вставить("ЗаданиеВыполнено", ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторФоновогоЗадания));
	
	Возврат Прогресс;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьРезультатНаФорме(АдресРезультата)
	
	РезультатМассив = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если РезультатМассив = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Список.Очистить();
	
	Для Каждого стр Из РезультатМассив Цикл
		Новая = Объект.Список.Добавить();
		Новая.Договор     = стр.Договор;
		Новая.Реализация  = стр.Реализация;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
